coq.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>The Coq Proof Assistant </title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="The Coq Proof Assistant "/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-07-27T16:10+0300"/>
<meta name="author" content="Mayer Goldberg"/>
<meta name="description" content="This page lists resources and some of my own work on the Coq Proof Assistant. "/>
<meta name="keywords" content="Mayer Goldberg, BGU, Ben-Gurion University, CS, computer science, computer science department, coq, automated theorem proving, logic, first-order logic, proof, constructive logic, computational logic, intuitionism, intuitionistic logic, thierry coquand, calculus of constructions, exercises in coq, problems in coq, tutorials for coq"/>
<link rel="icon" type="image/x-icon" href="http://www.little-lisper.org/website/favicon.ico" />
<link rel="apple-touch-icon" type="image/x-icon" href="http://www.little-lisper.org/website/favicon.png" />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">The Coq Proof Assistant </h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Proof Assistants</a>
<ul>
<li><a href="#sec-1-1">1.1 Benefits to researchers</a></li>
<li><a href="#sec-1-2">1.2 Benefits to instructors</a></li>
<li><a href="#sec-1-3">1.3 Benefits to students</a></li>
</ul>
</li>
<li><a href="#sec-2">2 Online Resources</a>
<ul>
<li><a href="#sec-2-1">2.1 The toolset &amp; documentation</a></li>
<li><a href="#sec-2-2">2.2 Andrej Bauer's tutorials on YouTube</a></li>
</ul>
</li>
<li><a href="#sec-3">3 My own examples of using Coq</a></li>
<li><a href="#sec-4">4 Useful imports</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Proof Assistants</h2>
<div class="outline-text-2" id="text-1">


<p>
At its most basic level, a proof assistant consists of 
</p>
<ul>
<li>a DSL (<i>Domain-Specific Language</i>) representing logical objects,
  as well as definitions and theorems about these objects
</li>
<li>a software platform for interactively constructing and validating these definitions and proofs. 
</li>
</ul>


<p>
At more advanced levels, the proof assistant can be &ldquo;taught&rdquo; to automate some of the steps of the proofs.
</p>
<p>
Proof assistants are for <i>theories</i> what calculators are for arithmetic problems. They do not obviate the need for understanding, but help raise it to a higher level of rigour. 
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Benefits to researchers</h3>
<div class="outline-text-3" id="text-1-1">


<ul>
<li>Factor out the correctness of the proofs out of your papers: Some
  reviewers don't have the time or the patience to follow your proofs,
  others don't really understand them. By using a proof assistant to
  code proofs, correctness becomes a non-issue. Instead, the
  researcher can focus on presentation, intuition, and the high-level
  structure of the proofs, and provide a URL to the proof files for
  the interested reviewers and reader. This lets the reviewers know
  that the proofs are correct, and allows them to verify the
  correctness.
</li>
<li>Because the details of the proofs can be relegated to an appendix,
  or to a file the URL of which is quoted in the paper, the paper can
  shrink in size to fit the tight page-limits some conferences and
  journals impose.
</li>
<li>By making the proof files available to readers, a researcher can
  help others to continue developing on his or her work. The proof
  files, which can be as short as small as a single proof, or as large
  as an entire theory, are a genuine contribution to the scientific
  community. 
</li>
</ul>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Benefits to instructors</h3>
<div class="outline-text-3" id="text-1-2">


<p>
In theory courses, the teaching staff must spend a lot of time
communiating formally with students, teaching students to communicate
formally, and evaluating and grading student work. Today, courses of
250-500 students are common, but the resources to teach and evaluate
students in a course have not grown proportionately. This means that
instruction is de-personalized, and graders can spend less time trying
to follow and evaluate student work. Put otherwise, there is no way to
grade thoroughly the work of hundreds of students, with the number of
graders and in the timeframe allotted. The quality of grading has
declined: It takes longer, there is less feedback, and the grading is
sloppier. 
</p>
<p>
Using a proof assistant for homework assignments changes the game
entirely: 
</p>
<ul>
<li>Students can see examples of air-tight, formal proofs, and can
  follow them, understanding the contribution of each step to the
  overall proof.
</li>
<li>Instructors can provide students with skeleton proofs, with the
  definitions, and statements of the lemmas and proofs already in
  place (if they so wish). The students can then fill in the details,
  and see how their proof comes to life.
</li>
<li>When students submit their proofs, they already know whether the
  proofs are correct or not. Verifying correctness is trivial.
</li>
<li>The students can receive instantaneous feedback from the proof
  assistant.
</li>
<li>The proofs are all typed up, in text format. It is easy to verify
  them mechanically, or even manually. It is easier to detect
  cheating.
</li>
<li>The correctness of the proofs can be factored out of the homework
  easily and quickly. If the assignment is to prove some theorem, the
  graders can focus on the structure, aesthetics, and economy of the
  proofs, i.e., what kinds of lemmas were used, and how they all fit
  together. 
</li>
<li>The tediousness of evaluating proofs manually encourages students to
  write impossibly-long, illegible proofs, in the hope that the grader
  will give them the benefit of the doubt and just assume their proofs
  are correct. When a proof is encoded formally using a proof
  assistant, there is a bottom line, and it is the proof assistant
  that the student has to convince. No matter how long and how tedious
  the proof, the student will not be able to get pass the proof
  assistant unless the proof is correct.
</li>
<li>The use of proof assistants opens the door towards exciting new ways
  of teaching. For example, it is possible to divide an assignment
  among students, each student &ldquo;in charge&rdquo; of proving some
  theorems, and for the total result to be a substantial, meaningful,
  collaborative work.
</li>
</ul>


</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Benefits to students</h3>
<div class="outline-text-3" id="text-1-3">


<ul>
<li>Feedback on assignments often reaches students very late, often too
  late to be of value. By using a proof assistant, students get
  instant, meaningful feedback on their ideas. Proof assistants are
  infinitely patient, very quick, and very pedantic. They are suitable
  for remote learning and self-learning.
</li>
<li>Human graders, often in a rush to finish grading, come with
  pre-conceived notions as to how some result can be proven. This can
  make them impatient or intolerant of different though correct
  proofs. With proof assistants, students need not fear that their
  graders misunderstood their proofs: If their proofs are correct,
  then the proof assistant will accept it, and so should the human
  grader. 
</li>
<li>Proof assistants facilitate better, deeper, more meaningful, and
  more productive interaction with the teaching staff: Rather than
  saying <i>I have no clue how to prove this</i>, students can try, and
  when they get stuck, email the proof file to their teaching staff,
  who can run it through the proof assistant, and suggest how to
  continue: either add some lemmas, or otherwise re-structure the
  proof. For example, an instructor may provide the proof of the
  theorem, based on some lemmas which are left unproven. The student
  can then try to fill in the proofs for these lemmas. 
</li>
<li>Interacting with a proof assistant is a great way to learn, because
  they force clarity and precision, and because they verify truth. My
  own [yet brief] experience with the Coq proof assistant has been
  very surprising in that respect. While I certainly understood much
  about the theories I tried to describe in Coq, the experience of
  encoding them revealed many subtle issues that I had hand-waived
  away. A proof assistant forces the student to become aware of all
  the subtleties, all the wrinkles, all the special cases and
  exceptions, and handle them, one-by-one, until a proof is <i>really</i>
  complete. The immediate effect on me has been a much greater clarity
  about what are the <i>real</i> issues in some theory.
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Online Resources</h2>
<div class="outline-text-2" id="text-2">



</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> The toolset &amp; documentation</h3>
<div class="outline-text-3" id="text-2-1">


<ul>
<li>The Coq system
</li>
<li>CoqIDE: The default IDE for constructing proofs using Coq. IDE that
  comes with the Coq system. It is provided for Linux, OSX, and even for MS Windows. 
</li>
<li><a href="http://proofgeneral.inf.ed.ac.uk/">The Proof General</a>: An emacs package for working with several proof
  assistants, including Coq. This is an IDE for constructing proofs
  using Coq. For emacs users, this is a great alternative to the
  CoqIDE system. Put otherwise, you should use the Proof General over the Coq IDE unless you absolutely refuse to use Emacs under any circumstances. The Proof General will make you a much more productive Coq user.
</li>
<li>The <i>coqdoc</i> utility: A utility for converting <code>.v</code> files into HTML,
  PDF, or any other useful format. Check out the options, by issuing
  <code>coqdoc --help</code>. Some useful options are <code>--pdf</code> (to generate PDF
  files), <code>--parse-comments</code> (to include comments in the <code>.v</code> files
  &mdash; I have no idea why this isn't on by default), and <code>-l</code> (for
  removing the proofs of the theorems and lemmas from the
  target/output document). The last option is useful, because Coq is a
  tool for creating proofs interactively, and the details of the proof
  make more sense when you verify them in <i>CoqIDE</i> or the <i>Proof   General</i>. The way I use <i>coqdoc</i> is via a <i>makefile</i> that contains a
  <i>rule</i> for converting <code>.v</code> files into corresponding <code>.pdf</code>
  files. Here's a copy of my makews-file:
</li>
</ul>




<pre class="example">.SUFFIXES:      .pdf .v

%.pdf:  %.v makefile
        coqdoc --pdf --parse-comments -l -o $*.pdf $*.v
</pre>

<ul>
<li><a href="http://www-sop.inria.fr/lemme/coq-graphs/">Coq Graphs</a>: A tool for visualizing whole files, or just a single
  proof. Creates a directed graph in <i>dot</i>, which is a part of the
  <a href="http://www.graphviz.org/">Graphviz</a> package. Apparently, this tool is no longer maintained, which is a shame!
</li>
</ul>


</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Andrej Bauer's tutorials on YouTube</h3>
<div class="outline-text-3" id="text-2-2">


<ul>
<li><a href="http://www.youtube.com/watch?v=COe0VTNF2EA">Obtaining and Instaling the Coq Proof Assistant</a>
</li>
<li><a href="http://www.youtube.com/watch?v=7sk8hPWAMSw">How to use CoqIDE</a>
</li>
<li><a href="http://www.youtube.com/watch?v=l6zqLJQCnzo">How to use Coq with Proof General</a>
</li>
<li><a href="http://www.youtube.com/watch?v=tZRAFKIv6Js">The dual Frobenius rule, part 1</a>
</li>
<li><a href="http://www.youtube.com/watch?v=XCsUZhx9OHg">The dual Frobenius rule, part 2</a>
</li>
<li><a href="http://www.youtube.com/watch?v=i2Q5GJhgsjA">Currying and uncurrying, part 1</a>
</li>
<li><a href="http://www.youtube.com/watch?v=2SjM5f3GkV0">Currying and uncurrying, part 2</a>
</li>
<li><a href="http://www.youtube.com/watch?v=fbt0TcLzrNg">Induction and recursion (natural numbers and trees)</a>
</li>
</ul>


<p>
**<a href="http://www.cis.upenn.edu/~bcpierce/sf/">Benjamin Pierce's book <i>Software Fountations</i></a>
</p></div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> My own examples of using Coq</h2>
<div class="outline-text-2" id="text-3">

<ul>
<li><a href="http://www.little-lisper.org/website/files/copi-symbolic-logic.v">Proofs to exercises in Irving M Copi's book <i>Symbolic Logic</i>, 5th edition</a>. This used to be a very popular introductory logic textbook, and contains many exercises in classical logic. Proving these theorems within Coq turns out to be trivial for a few, and totally non-trivial for many. This is a wonderful Coq workout, because it reinforces the distinction between theorems that can be proven in intuitionistic logic vs those that require classical logic.
</li>
<li><a href="http://www.little-lisper.org/website/files/reproducing-theorems-on-nat.v">The builtin tactics for working with Peano numbers &ndash; proven anew here.</a>
</li>
<li><a href="http://www.little-lisper.org/website/files/lists-in-coq.v">Lists re-done in Coq</a>.
</li>
<li>The basic theorems on groups done in Coq.
</li>
<li>The basic theorems on fields done in Coq.
</li>
</ul>

</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Useful imports</h2>
<div class="outline-text-2" id="text-4">

<ul>
<li><code>Require Import List.</code> To work with lists.
</li>
<li><code>Require Import Setoid.</code> Needed to use the <code>rewrite</code> tactic.
</li>
<li><code>Require Import Arith.</code> Needed for doing basic arithmetic.
</li>
<li><code>Require Import Ascii.</code>
</li>
<li><code>Require Import ClassicalFacts.</code> Needed for proving statements using <i>classical</i> (as opposed to <i>intuitionistic</i>) logic. Defines such things as <i>the law of the excluded middle</i>, propositional extensionality, etc.
</li>
</ul>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-07-27T16:10+0300</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
